Author=Joel Toivonen (hukka) <hukkax@gmail.com>
SourceLANGID=1033
LANGID=1035
Generator=DKLang Translation Editor v3.0
LastModified=2007-11-07 03:18:51

[FAbout]
00000001=Tietoja Fonystä
00000002=OK
00000003=Käytetyt komponentit:

[FConfig]
00000001=Asetukset
00000009=OK
00000010=Oletukset
00000011=Yleistä
00000012=Muokkaus
00000013=Muokkaustapa
00000014=Oikea näppäin sammuttaa pikselin, keskimmäinen vaihtaa pikselin tilaa.
00000015=Vasen näppäin sytyttää pikselin
00000016=Vasen näppäin vaihtaa pikselin tilaa
00000017=Käytä vanhanmallisia tiedostonselausdialogeja
00000018=Skaalaa glyyfit sopimaan editoriin ei-tasalevyistä fonttia muokattaessa
00000019=Paletti
00000020=Editorin taustaväri
00000021=Editorin tausta\nEditorin glyyfi\nEditorin ristikko\nEditorin perusviiva\nGlyyfivalitsimen tausta\nGlyyfivalitsimen glyyfit\nValitun glyyfin tausta\nValittu glyyfi\n
00000025=Kieli

[FEditor]
00000001=Glyyfieditori

[FExportBitmap]
00000001=Vie bittikartta
00000002=Kirjoita bittikarttaan
00000003=Merkkijono:
00000004=Merkit väliltä:
00000005=Bitmap Font Writerin formaatissa
00000006=Värit
00000007=BG:
00000008=FG:
00000009=Läpinäkyvä tausta
00000016=OK
00000017=Peruuta
00000018=Reunus
00000019=PNG-kuvat|*.png|BMP-kuvat|*.bmp
00000020=<filename> - Tiedoston nimi ilman tiedostopäätettä\n<name> - Kirjasimen nimi\n<size> - Kirjasimen koko\n<i0> - Glyyfin indeksi (ensimmäinen tallennettava = 0)\n<i> - Glyyfin indeksi (ensimmäinen tallennettava = 1)\n<a> - Glyyfin ASCII-arvo
00000022=Kirjoita jokainen glyyfi omaan tiedostoonsa
00000023=Nimeämiskaava:

[FImportBitmap]
00000001=Tuo bittikartta
00000002=Glyyfin/bittikartan koko
00000003=Leveys:
00000004=Korkeus:
00000005=Rivejä:
00000006=Sarakkeita:
00000007=Taustan väri
00000008=Automaattinen
00000012=Bittikartan sisältämät merkit
00000013=Merkkijono:
00000014=Alue:
00000015=OK
00000016=Peruuta

[FInfo]
00000001=Fontin tiedot
00000003=Ensimmäinen merkki
00000023=OK
00000024=Peruuta
00000025=Perusasetukset
00000026=Lisäasetukset
00000027=Copyright
00000028=Korkeus (pikseliä)
00000029=Perusviiva
00000030=Nimi
00000031=Viimeinen merkki
00000032=Yliviivattu
00000033=Alleviivattu
00000034=Kursivoitu
00000035=Tasalevyinen
00000036=Paino
00000037=Perhe
00000038=Merkistö
00000039=Oletusmerkki,\nSanankatkaisumerkki
00000040=Internal leading,\nRivinväli
00000041=Resoluutio\nHoris., Vert
00000043=Thin\nExtra-light\nLight\nRegular\nMedium\nSemi-bold\nBold\nExtra-bold\nBlack\n
00000045=Ei väliä\nRoman\nSwiss\nModern\nScript\nDecorative\n
00000046=Muu:\nANSI\nSymbol\nOEM\n
00000047=Käyttää Windows 2:n tiedostoformaattia
00000048=(Ensimmäisestä merkistä laskien)

[FMain]
00000001=Fony
00000010=Windows-bittikarttafontit|*.fon;*.fnt
00000011=FON-fontit|*.fon|FNT-fonttiresurssit|*.fnt
00000097=Tuetut tiedostomuodot (BMP, PNG)|*.bmp;*.png
00000165=Tiedosto
00000166=Muokkaa
00000167=Työkalut
00000168=Fontit
00000169=Apua
00000170=Uusi
00000171=Uusi
00000172=Kumoa
00000173=Kumoa viimeiset muutokset
00000174=Peilaa horis.
00000175=Peilaa horisontaalisesti
00000176=Peilaa vert.
00000177=Peilaa vertikaalisesti
00000178=Avaa asennettu fontti...
00000179=Avaa asennettu...
00000180=Avaa tiedosto...
00000181=Avaa...
00000182=Tallenna
00000183=Tallenna
00000184=Tallenna nimellä...
00000185=Tallenna nimellä...
00000186=Poistu
00000187=Poistu ohjelmasta
00000188=Kopioi
00000189=Kopioi
00000190=Liitä
00000191=Liitä
00000192=Lataa uudelleen
00000193=Lataa tiedosto uudelleen
00000194=Tyhjennä
00000195=Tyhjennä glyyfi
00000196=Tee käänteinen
00000197=Tee glyyfistä käänteinen
00000198=Muuta kokoa...
00000199=Ominaisuudet
00000200=Fontin ominaisuudet
00000201=Testaa fonttia
00000202=Testaa fonttia
00000203=Asetukset
00000204=Asetukset...
00000205=Asennettu TrueType-fontti...
00000206=Amigan bittikarttafontti
00000207=Bittikartasta...
00000208=BDF-fontti...
00000209=Bitmap Font Writer -fontti...
00000210=Bittikartta...
00000211=BDF-fontti...
00000212=Vie
00000213=Tuo
00000214=Avaa uudelleen
00000215=Peilaa horis.
00000216=Peilaa vert.
00000217=Peilaa
00000218=Tietoja...
00000219=Tee lahjoitus

[FOpenFont]
00000001=Avaa asennettu fontti
00000002=OK
00000003=Peruuta

[FPreview]
00000001=Esikatselu
00000014=Suurenna

[FProportional]
00000001=Muunna fontti
00000002=Lisää oikeaan reunaan tyhjää (pikseleinä):
00000003=Valitse sopivat leveydet merkeille automaattisesti
00000004=OK
00000005=Peruuta

[FResizeFont]
00000001=Fontin koon muunnos
00000002=OK
00000003=Peruuta
00000005=Horisontaalisesti:
00000006=Vertikaalisesti:
00000007=Pikselillä
00000008=Prosenttia
00000009=Puolita koko
00000010=Tuplaa koko

[FSaveFont]
00000001=Valitse tallennettavat fontit
00000002=OK
00000003=Peruuta

[FTools]
00000001=Työkalut
00000002=Piirrä vapaasti
00000003=Piirrä viivoja
00000004=Täytä alueita
00000005=Siirrä
00000006=Glyyfi
00000007=Windows-glyyfi
00000008=OEM-glyyfi
00000009=Glyyfi
00000010=Leveys

[$CONSTANTS]
MSTR_ABOUTDIALOG=Versio $Version$\n\nKäännetty\n$BuildDate$
MSTR_ASKSAVE_NO=Hylkää
MSTR_ASKSAVE_YES=Tallenna
MSTR_CANCEL=Peruuta
MSTR_CONFIRM_CONVERTMONOSPACED=Muutetaanko fontti tasalevyiseksi?\nGlyyfien uusi leveys tulee olemaan %d pikseliä.
MSTR_CONFIRM_CONVERTMONOSPACED_TITLE=Muunna tasalevyiseksi
MSTR_CONFIRM_DELETEFONT=Haluatko varmasti poistaa tämän fontin?
MSTR_CONFIRM_DELETEFONT_TITLE=Varmista fontin poisto
MSTR_CONFIRM_FONTMODIFIED=Fonttia on muokattu.\nTallennetaanko siihen tehdyt muutokset?
MSTR_CONFIRM_FONTMODIFIED_TITLE=Fonttia on muokattu
MSTR_CONFIRM_RESETSETTINGS=Palautetaanko oletusasetukset?
MSTR_CONFIRM_RESETSETTINGS_TITLE=Oletusasetusten palautus
MSTR_DIALOG_CONFIRM=Varmista
MSTR_DIALOG_ERROR=Virhe
MSTR_DIALOG_NOTICE=Huomautus
MSTR_DIALOG_WARNING=Varoitus
MSTR_DONE_BFWIMPORT=Bitmap Font Writer -fontti tuotu.
MSTR_DONE_CONVERTMONOSPACED=Fontti muutettu tasalevyiseksi.
MSTR_DONE_CONVERTPROPORTIONAL=Fontti muutettu vaihtuvalevyiseksi.
MSTR_DONE_EXPORTBITMAP=Bittikartta tallennettu.
MSTR_DONE_FONTCREATE=Uusi fontti luotu.
MSTR_DONE_FONTIMPORT=Fontti tuotu.
MSTR_DONE_FONTINSTALL=Fontti asennettu. (%s)
MSTR_DONE_FONTLIST_NEWFONT=Uusi fontti luotu.
MSTR_DONE_FONTLIST_REMOVEFONT=Fontti poistettu.
MSTR_DONE_FONTLOAD=Fontti ladattu.
MSTR_DONE_FONTRESIZE=Fontti skaalattu.
MSTR_DONE_FONTSAVE=Fontti tallennettu.
MSTR_DONE_IMPORTFNT_MANY=%d fonttiresurssia tuotu.
MSTR_DONE_IMPORTFNT_ONE=Fonttiresurssi tuotu.
MSTR_ERROR_FONTLOAD=Virhe fonttia ladattaessa:
MSTR_ERROR_FONTLOAD_TITLE=Virhe fonttia ladattaessa
MSTR_ERROR_GETBITMAPFONTS=Asennettuja bittikarttafontteja ei löytynyt!
MSTR_ERROR_GETBITMAPFONTS_TITLE=Virhe
MSTR_FILEDIALOG_ALLFILES=Kaikki tiedostot
MSTR_FILEDIALOG_AMIGABITMAPFONTS=Amigan bittikarttafontit
MSTR_FILEDIALOG_BDFBITMAPFONTS=BDF-fontit
MSTR_FNT_ERROR_DATATOOSHORT=Liian lyhyt tietue.
MSTR_FNT_ERROR_FILENOTFOUND=Tiedostoa ei löydy.
MSTR_FNT_ERROR_INVALIDBOUNDARIES=Fonttiresurssin koko tai sijainti ei kelpaa.
MSTR_FNT_ERROR_INVALIDHEADER=Epäkelpo otsake.
MSTR_FNT_ERROR_INVALIDNEHEADER=Sopivaa NE-otsaketta ei löydy tiedostosta.
MSTR_FNT_ERROR_NONE=Ei virhettä
MSTR_FNT_ERROR_OVERRUN=Bittikarttadata ei ole kokonaan tiedoston rajojen sisällä.
MSTR_FNT_ERROR_UNKNOWN=Tuntematon virhe!
MSTR_FNT_ERROR_UNSUPPORTED=Fontti on muodossa, jota ohjelma ei tue.
MSTR_FNT_ERROR_VECTORFONT=Ohjelma ei tue vektorifontteja.
MSTR_FONTLIST_NEWFONT=Uusi fontti
MSTR_FONTMENU_ADD=Lisää...
MSTR_FONTMENU_ADDFROMFILE=Lisää tiedostosta...
MSTR_FONTMENU_REMOVE=Poista fontti
MSTR_NO=Ei
MSTR_OK=OK
MSTR_WARNING_FONTLOAD=Varoitus:
MSTR_WARNING_FONTLOAD_TITLE=Varoitus
MSTR_WARNING_NOFONTLOADED=Ei fonttia avoinna
MSTR_YES=Kyllä
